In [ ]:
! pip install ipython-sql

In [1]:
%load_ext sql

In [2]:
%sql sqlite:///C:\Users\bilene\book.db

In [ ]:
output = %sql SELECT pop FROM indicators0

In [ ]:
import pandas as pd
pd.DataFrame(output,columns=['pop'])

In [ ]:
%%sql 
output2 <<
SELECT pop 
FROM indicators0

In [ ]:
output2

In [ ]:
%%sql
SELECT name FROM topnames
LIMIT 5

In [ ]:
%%sql
SELECT year, name, sex FROM topnames
LIMIT 5

In [ ]:
%%sql
SELECT year AS Year, name, sex FROM topnames
LIMIT 5

In [ ]:
%%sql
SELECT * FROM topnames
LIMIT 5

In [ ]:
%%sql
-- Here is a one line comment
/* Here is a multi line comment
 Another one */
    
-- The following returns all tables that exist
-- in the database
SELECT name FROM sqlite_master WHERE type='table'

In [ ]:
%%sql
-- Row filtering
SELECT * FROM indicators 
WHERE year>=2000
LIMIT 10

In [ ]:
%%sql
SELECT * FROM indicators 
WHERE pop > 1000 AND life > 60
LIMIT 10

In [ ]:
%%sql
SELECT * FROM countries
LIMIT 10

In [ ]:
%%sql
-- Return only high income countries
SELECT * FROM countries
WHERE income = 'High income'
LIMIT 5

In [ ]:
%%sql
-- Return rows where baby name is not John
-- In pandas: name != 'John'
SELECT name, sex FROM topnames
WHERE name <> 'John'
-- keep in mind this still works: WHERE name != 'John'
LIMIT 5

In [ ]:
%%sql
SELECT * FROM countries
LIMIT 5

In [ ]:
%%sql
-- Return countries with land > 10000 and the country must be either
-- High income, or Upper middle income

SELECT * FROM countries
WHERE (land>10000) AND (income='High income' OR income='Upper middle income')
LIMIT 5

In [ ]:
%%sql
-- Filter intervals
SELECT * FROM indicators
WHERE life BETWEEN 65 AND 75
LIMIT 5

In [ ]:
%%sql
-- Return where year is 2017 and countries with code
-- CHN, IND, FRA, USA
SELECT * FROM indicators
WHERE year = 2017 AND code IN ('CHN','IND','FRA','USA')
LIMIT 5

In [ ]:
%%sql
-- Wildcard, %
-- Return countries whose names start with "United"
SELECT * FROM countries
WHERE country LIKE 'United%'
LIMIT 5

In [ ]:
%%sql
-- Wildcard
-- Return back countries whose names start with A and end with a
SELECT * FROM countries
WHERE country LIKE 'A%a'
LIMIT 10

In [ ]:
%%sql
-- Return back the countries whose code ends with "ZA"
-- forces the output "code" to have three characters
SELECT * FROM countries
WHERE code LIKE '_ZA'

In [ ]:
%%sql
-- Return back the countries whose code ends with "A"
-- force the output "code" to have three characters
SELECT * FROM countries
WHERE code LIKE "__A"
LIMIT 10

In [ ]:
%%sql
-- return back non-missing values based on a column
SELECT * FROM countries
WHERE land IS NOT NULL
LIMIT 50

In [ ]:
%%sql
-- return back missing values based on a column
SELECT * FROM countries
WHERE land IS NULL
LIMIT 50

In [ ]:
%%sql
-- Create a new column called "newpop" that equals pop*1.15 in
-- the table indicators0
-- round the fractions
SELECT *, ROUND(pop*1.15,2) AS newpop FROM indicators0
LIMIT 5

In [ ]:
%%sql
-- create an indicator variable (dummy variable, binary variable)
-- that equals 1 if life > 75, 0 otherwise.
SELECT *, life>75 AS longlife FROM indicators0
LIMIT 5

In [ ]:
'word1' + ' ' + 'word2'

In [ ]:
%%sql
-- create a new column called country2 that has the following
-- format 'Countryname (3digitcode)'
-- || in sql is equivalent to + in python
SELECT *, country || ' (' || code || ')' AS country2 FROM countries
LIMIT 5

In [4]:
%%sql
-- COUNT function counts all values
-- countries table has 217 observations
SELECT COUNT(*) AS total FROM countries

 * sqlite:///C:\Users\bilene\book.db
Done.

[(217,)]

In [5]:
%%sql
-- COUNT function counts all values
-- countries table has 7 missing rows for 'land'
SELECT COUNT(*) AS missing_land FROM countries
WHERE land IS NULL

 * sqlite:///C:\Users\bilene\book.db
Done.

[(7,)]

In [6]:
%%sql
-- put the two numbers side by side
-- an example of a nested sql queries
SELECT COUNT(*) AS total,
(SELECT COUNT(*) FROM countries
WHERE land IS NULL) AS missing_land
FROM countries

 * sqlite:///C:\Users\bilene\book.db
Done.

[(217, 7)]

In [11]:
%%sql
-- count the number of unique names inside the topnames table
-- change the column name to unique_babynames
SELECT COUNT(DISTINCT name) AS unique_babynames FROM topnames

 * sqlite:///C:\Users\bilene\book.db
Done.

[(18,)]

In [12]:
%%sql
SELECT * FROM indicators0
LIMIT 5

 * sqlite:///C:\Users\bilene\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('FRA', 66.87, 2586.29, 82.5, 69.02),
 ('GBR', 66.06, 2637.87, 81.2, 79.1),
 ('IND', 1338.66, 2652.55, 68.8, 1168.9),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [25]:
%%sql
-- return a table that contains the average pop, gdp
-- life, cell in the entire table
SELECT ROUND(AVG(pop),2) AS avg_pop, AVG(gdp) AS avg_gdp, 
AVG(life) AS avg_life, AVG(cell) AS avg_cell, COUNT(*) AS n_obs
FROM indicators0

 * sqlite:///C:\Users\bilene\book.db
Done.

[(636.63, 7901.122, 77.48, 635.7, 5)]

In [32]:
%%sql
-- return back all columns that exist in the indicators0 table
-- for countries whose gdp is greater than the average gdp
-- of the countries in the dataset
SELECT *
FROM indicators0
WHERE gdp>(SELECT AVG(gdp) FROM indicators0)

 * sqlite:///C:\Users\bilene\book.db
Done.

[('CHN', 1386.4, 12143.5, 76.4, 1469.88),
 ('USA', 325.15, 19485.4, 78.5, 391.6)]

In [34]:
%%sql
-- return back the countries whose gdp is greater than
-- the average gdp in 1990 for the year 1990
-- using the indicators table
SELECT * FROM indicators
WHERE gdp>(SELECT AVG(gdp) FROM indicators
          WHERE year=1990)
AND year=1990

 * sqlite:///C:\Users\bilene\book.db
Done.

[(1990, 'ARG', 32.62, 141.35, 71.6, 0.01, 4078.48, 12352.0),
 (1990, 'AUS', 17.07, 310.77, 77.0, 0.18, 43051.4, 38982.5),
 (1990, 'AUT', 7.68, 166.46, 75.6, 0.07, 49287.2, 41389.8),
 (1990, 'BEL', 9.97, 206.43, 76.1, 0.04, None, None),
 (1990, 'BRA', 149.0, 461.95, 65.3, 0.0, 24977.3, 31388.9),
 (1990, 'CAN', 27.69, 593.93, 77.4, 0.58, 131641.0, 126441.0),
 (1990, 'CHE', 6.72, 258.07, 77.2, 0.13, 69703.8, 63797.4),
 (1990, 'CHN', 1135.18, 360.86, 69.3, 0.02, 53809.6, 62755.9),
 (1990, 'DEU', 79.43, 1764.97, 75.2, 0.27, 346415.0, 408874.0),
 (1990, 'DNK', 5.14, 138.25, 74.8, 0.15, 31371.7, 34030.1),
 (1990, 'ESP', 38.87, 535.1, 76.8, 0.05, 87808.4, 55651.4),
 (1990, 'FIN', 4.99, 141.52, 74.8, 0.26, 26943.9, 26569.6),
 (1990, 'FRA', 58.24, 1269.18, 76.6, 0.28, 233954.0, 212086.0),
 (1990, 'GBR', 57.25, 1093.17, 75.9, 1.11, 223036.0, 185030.0),
 (1990, 'IND', 873.28, 320.98, 57.9, 0.0, 23991.4, 17811.2),
 (1990, 'IRQ', 17.42, 179.89, 66.1, 0.0, 6525.51, 10313.6),
 (1990, 'ITA', 56.72, 1177.33, 77.0, 0.27, 181767.0, 170275.0),
 (1990, 'JPN', 123.54, 3132.82, 78.8, 0.87, 235333.0, 287796.0),
 (1990, 'KOR', 42.87, 279.35, 71.6, 0.08, 74404.9, 67813.9),
 (1990, 'MEX', 83.94, 261.25, 70.8, 0.06, 33021.2, 27167.3),
 (1990, 'NLD', 14.95, 318.33, 76.9, 0.08, 123379.0, 130662.0),
 (1990, 'RUS', 148.29, 516.81, 68.9, 0.0, None, None),
 (1990, 'SWE', 8.56, 258.44, 77.5, 0.46, 49354.0, 53066.2),
 (1990, 'TUR', 53.92, 150.68, 64.3, 0.03, 23147.1, 13384.4),
 (1990, 'USA', 249.62, 5963.14, 75.2, 5.28, 517014.0, 392743.0)]

In [39]:
%%sql
-- calculate the total land area of all countries in the
-- countries table
SELECT SUM(land) FROM countries

 * sqlite:///C:\Users\bilene\book.db
Done.

[(127307840.0,)]

In [43]:
%%sql
-- return the total land area by region
SELECT region, SUM(land) AS total_land FROM countries
GROUP BY region
ORDER BY total_land DESC

 * sqlite:///C:\Users\bilene\book.db
Done.

[('Europe & Central Asia', 27429254.6),
 ('East Asia & Pacific', 24361338.4),
 ('Sub-Saharan Africa', 21242361.0),
 ('Latin America & Caribbean', 20038832.0),
 ('North America', 18240984.0),
 ('Middle East & North Africa', 11223466.0),
 ('South Asia', 4771604.0)]

In [47]:
%%sql
-- return back a table that shows 
-- the land area of each county
-- sorted by land area (descending)
SELECT country, land FROM countries
ORDER BY land DESC
LIMIT 10

 * sqlite:///C:\Users\bilene\book.db
Done.

[('Russian Federation', 16376900.0),
 ('China', 9388210.0),
 ('United States', 9147420.0),
 ('Canada', 9093510.0),
 ('Brazil', 8358140.0),
 ('Australia', 7692020.0),
 ('India', 2973190.0),
 ('Argentina', 2736690.0),
 ('Kazakhstan', 2699700.0),
 ('Algeria', 2381740.0)]

In [51]:
%%sql
-- how do you groupby and then filter after?
SELECT region, SUM(land) AS total_land FROM countries
GROUP BY region
HAVING total_land > 20000000

 * sqlite:///C:\Users\bilene\book.db
Done.

[('East Asia & Pacific', 24361338.4),
 ('Europe & Central Asia', 27429254.6),
 ('Latin America & Caribbean', 20038832.0),
 ('Sub-Saharan Africa', 21242361.0)]